app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.author= $author
    @comment.author_name= $author.name
    respond_to do |format|
      @comment.author=$author
      if @comment.save
---
INSERT INTO `comments` (`article_name`, `description`, `author_id`, `author_type`, `author_name`, `created_at`, `updated_at`) VALUES ('php', 'this is php', '1', 'Student', 'sree', '2015-02-10 06:57:08.715990', '2015-02-10 06:57:08.715990')

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE `comments` SET `description` = 'asdasdad', `updated_at` = '2015-02-10 06:17:05.221936' WHERE `comments`.`id` = 7

  def destroy
    @comment.destroy
---
DELETE FROM `comments` WHERE `comments`.`id` = 3

    def set_author
      $author=Student.find(params[:sid]) if params[:sid]
      $author=Teacher.find(params[:tid]) if params[:tid]
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 2 LIMIT 1
SELECT  `teachers`.* FROM `teachers` WHERE `teachers`.`id` = 1 LIMIT 1